# Pandas 
Intro to Pandas

In [2]:
import pandas as pd

## Data types 
series and dataframe 

### Series
Series is one dimensional

In [3]:
series=pd.Series(["Lamborgini","BMW","Toyota"])
colours=pd.Series(["Brown","Blue","Black"])
series

0    Lamborgini
1           BMW
2        Toyota
dtype: object

### Dataframe
dataframe= 2-dimensional datatype   
It is like dictionary (may have many columns)

In [4]:
carData=pd.DataFrame({"Car Name":series,"Colour":colours})
carData

     Car Name Colour
0  Lamborgini  Brown
1         BMW   Blue
2      Toyota  Black

### Getting data from csv file

In [5]:
carSales=pd.read_csv("car-sales.csv")

In [6]:
carSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
#Exporting dataframe
carSales.to_csv("newCarSales.csv",index=False)
#if index is true then two indexes will be displayed as while exporting new index is added by default

### Describing data

In [8]:
carSales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [9]:
carSales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [10]:
carSales.describe()
#describe only works for numeric columns

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [11]:
carSales["Doors"].sum()

np.int64(40)

In [12]:
carSales["Odometer (KM)"].median()

np.float64(57369.0)

In [14]:
#we are comparing different columns in the data
pd.crosstab(carSales["Make"],carSales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0